Repository: MetaModels/filter_text
Catalog: src/Resources/translations/*_metamodel_filtersetting.*.xlf
Languages: de

# textsearch.label
source: Search type
de: Suchtyp

# textsearch.description
source: Finding text parts.
de: Dieser Filter findet Textstellen.

# delimiter.label
source: Delimeter
de: Trennzeichen (Delimeter)

# delimiter.description
source: Set delimeter for search type "any" or "all" - default delimeter is space.
de: Geben Sie das Trennzeichen für den Suchtyp "einige" oder "alle" an. Das Standardtrennzeichen ist das Leerzeichen.

# pattern.label
source: Regexp pattern
de: RegExp-Muster

# pattern.description
source: Set the "https://dev.mysql.com/doc/refman/5.6/en/regexp.html" with only one placeholder "%s" for your search string. See at MySQL regexp for more information.
de: Erstelle ein RegExp-Muster mit einem Platzhalter "%s" für die Suche; siehe MySQL "https://dev.mysql.com/doc/refman/5.6/en/regexp.html".

# references.exact
source: exact search
de: genaue Suche

# references.beginswith
source: begins with search term
de: beginnt mit Suchbegriff

# references.endswith
source: ends with search term
de: endet mit Suchbegriff

# references.any
source: search any word (OR)
de: suche einige Wörter (ODER)

# references.all
source: search all words (AND)
de: suche alle Wörter (UND)

# references.regexp
source: Regexp pattern
de: RegExp-Muster
